public class RunTheTrain {
	

	public static void main(String[] args) {
		 
		Train interCity = new Train(new Integer[] {15, 3, 0, 9, 52}, 2);
		interCity.transferBetweenCarriages();
	}
}

/*Те саме, що в завданні 1, але мета інша...
Поїзд проходить N=5 станцій. На кожній станції в кожному вагоні відбувається наступне:
а) довільно від 0 до 10 пасажирів заходять або виходять з вагона.
б) навмання від 0 до 3 пасажирів пересідають у вагон попереду або позаду
c) a або b можливі лише якщо у вагоні достатньо вільних місць і кількість вільних місць не може 
перевищувати K=54
Мета завдання – перерахувати ціль для задачі 1 і відобразити номер вагона в консолі для початкового стану
 поїзда та після кожної станції.
*/